## [applications/ansible-test](https://omicron7.app.spacelift.io/stack/applications-ansible-test/run/01HSE8FY08R4GC7RXE5V4YTNY1) plan logs

<details>
<summary>Click here to expand</summary>

```
[01HSE34JKE105G02YQ4115JEFG] Planning changes with 0 custom hooks...
data.spacelift_current_stack.this: Reading...
data.spacelift_aws_integration.aws: Reading...
data.spacelift_current_stack.this: Read complete after 0s [id=applications-ansible-test]
data.spacelift_stack.this: Reading...
ansible_host.baz: Refreshing state... [id=baz]
ansible_host.bar: Refreshing state... [id=bar]
ansible_group.linux: Refreshing state... [id=linux]
ansible_host.foo: Refreshing state... [id=foo]
data.spacelift_aws_integration.aws: Read complete after 0s [id=01HQV4XANFANXQY4NS3HDNJSCN]
data.spacelift_stack.this: Read complete after 1s [id=applications-ansible-test]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # spacelift_aws_integration_attachment.aws will be created
  + resource "spacelift_aws_integration_attachment" "aws" {
      + attachment_id  = (known after apply)
      + id             = (known after apply)
      + integration_id = "01HQV4XANFANXQY4NS3HDNJSCN"
      + read           = true
      + stack_id       = (known after apply)
      + write          = true
    }

  # spacelift_stack.ansible will be created
  + resource "spacelift_stack" "ansible" {
      + administrative                   = false
      + autodeploy                       = false
      + autoretry                        = false
      + aws_assume_role_policy_statement = (known after apply)
      + branch                           = "main"
      + enable_local_preview             = false
      + github_action_deploy             = true
      + id                               = (known after apply)
      + manage_state                     = true
      + name                             = "applications/ansible-test Ansible"
      + project_root                     = "/"
      + protect_from_deletion            = false
      + repository                       = "spacelift-ansible"
      + slug                             = (known after apply)
      + space_id                         = "omicron7-01HS1TBZCJ35FSNJ9AC9QTY7WF"
      + terraform_external_state_access  = false
      + terraform_smart_sanitization     = false
      + terraform_workflow_tool          = (known after apply)

      + ansible {
          + playbook = "playbook.yml"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

[01HSE34JKE105G02YQ4115JEFG] Changes are GO
[01HSE34JKE105G02YQ4115JEFG] Uploading the list of managed resources...
[01HSE34JKE105G02YQ4115JEFG] Please be aware that the run changes calculation includes output changes.
[01HSE34JKE105G02YQ4115JEFG] Resource list upload is GO
[01HSE34JKE105G02YQ4115JEFG] Generating JSON representation of the plan...
[01HSE34JKE105G02YQ4115JEFG] JSON representation is GO
[01HSE34JKE105G02YQ4115JEFG] Loading custom plan policy inputs...
[01HSE34JKE105G02YQ4115JEFG] 0 custom plan policy inputs found
[01HSE34JKE105G02YQ4115JEFG] No plan policies to evaluate
```

</details>